{
  "1": {
    "skillId": "1",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "The email module covered how email fits into an inbound marketing strategy and why it's such a high-ROI channel when done well. Learned the basics of creating marketing emails in HubSpot: from setting up email types to understanding deliverability and engagement. The course emphasized that consumers actually want to hear from brands through email.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "188": {
    "skillId": "188",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "Google AI Essentials Certification",
        "description": "Completed Google's AI certification in about 6 hours, covering AI fundamentals: how AI works, what machine learning actually is, and how generative AI produces outputs. The course walked through real concepts like training data, model capabilities and limitations, and why human oversight matters when using AI tools.",
        "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/UR9LLMDF6JXS",
        "date": "July 2025"
      }
    ]
  },
  "189": {
    "skillId": "189",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "Google AI Essentials Certification",
        "description": "Learned how large language models actually work through Google's 6-hour AI Essentials course. Covered the basics of how these models are trained on data, how they generate text, and why you need to evaluate their outputs before using them. The course emphasized understanding what LLMs can and can't do reliably.",
        "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/UR9LLMDF6JXS",
        "date": "July 2025"
      }
    ]
  },
  "190": {
    "skillId": "190",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "Google AI Essentials Certification",
        "description": "Google's AI Essentials taught me how to write clear, specific prompts to get useful outputs from AI tools. The 'Discover the Art of Prompt Engineering' module covered techniques like few-shot prompting and how to structure prompts for different workplace tasks—from drafting emails to organizing event logistics.",
        "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/UR9LLMDF6JXS",
        "date": "July 2025"
      }
    ]
  },
  "191": {
    "skillId": "191",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "Google AI Essentials Certification",
        "description": "The course showed practical applications of AI for everyday work tasks: generating ideas when stuck at the start of a project, researching and organizing information for events, and speeding through flooded inboxes by drafting email responses. Learned when to use AI tools versus when they're not the right fit.",
        "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/UR9LLMDF6JXS",
        "date": "July 2025"
      }
    ]
  },
  "194": {
    "skillId": "194",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "Google AI Essentials Certification",
        "description": "Google's course dedicated a full module to using AI responsibly: identifying potential biases in AI outputs, understanding security risks when working with AI tools, and applying a framework for recognizing AI harms in real workplace scenarios. Walked away with a practical checklist for responsible AI use.",
        "url": "https://www.coursera.org/account/accomplishments/specialization/certificate/UR9LLMDF6JXS",
        "date": "July 2025"
      }
    ]
  },
  "195": {
    "skillId": "195",
    "evidenceCount": 2,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Used chain-of-thought prompting to walk Claude through complex features, few-shot examples to show what I wanted the UI to look like, and structured my requests to get consistent code output across 50+ iterations. The key was breaking down what I needed into clear, sequential prompts rather than asking for everything at once and hoping it worked.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      },
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Worked through complex Webflow challenges by using chain-of-thought prompting with Claude—describing the problem in detail, walking through what I'd already tried, and asking Claude to reason through solutions step-by-step. This approach was crucial for troubleshooting issues I hadn't encountered before, like mobile responsive layout bugs and section structure problems. The iterative back-and-forth meant each prompt built on what we learned from the last attempt.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },
  "199": {
    "skillId": "199",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Worked through an intentional refinement process with Claude—ideation, planning how to make it valuable, building the initial version with few-shot prompting, then iterating in groups and sections until it was launchable. I'd test changes locally before committing, making sure each iteration actually improved things. It's not perfect, but it's functional enough to use and keep improving, which was the whole point.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      }
    ]
  },
  "200": {
    "skillId": "200",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Collaborated with Claude to write and refine most of the website copy across services, about, and portfolio pages. I'd draft initial content or describe what I needed, Claude would generate options, and we'd iterate until the voice felt authentic and conversion-focused. The AI handled structure and polish while I ensured the tone stayed conversational and honest about my experience.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },
  "209": {
    "skillId": "209",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Designed a repeatable workflow for this project: ideation, planning, few-shot prompting with examples, then iterative refinement. I set up two Claude Projects: one as a content writer for portfolio pieces, and another to update the web app itself. Both can handle the JSON files directly, so I can add new galaxies, constellations, skills, and evidence without touching code.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      }
    ]
  },
  "254": {
    "skillId": "254",
    "evidenceCount": 2,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Built conversion-focused landing pages for services, about, and portfolio sections with clear value propositions and strategic CTAs. Each page serves a specific purpose in the user journey—services pages sell the offering, portfolio pages demonstrate capability, about page builds trust. Structured each with hero sections, supporting content, and next-step CTAs to guide visitors toward getting in touch.",
        "url": "andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "December 2025"
      },
      {
        "type": "case",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "While the certification focused on the broader Marketing Hub capabilities, it covered how landing pages work with forms and CTAs to convert visitors. Learned how landing pages fit into campaign strategy—creating dedicated pages for specific offers that align with your campaign goals.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "257": {
    "skillId": "257",
    "evidenceCount": 2,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Designed the contact form strategy with minimal friction: just name, email, and message fields to reduce abandonment. Set up the form to store submissions in both Webflow and HubSpot for lead management, with clear next-step messaging on the thank-you page. Kept it privacy-friendly by only collecting essential information and being transparent about how the data would be used.",
        "url": "andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "December 2025"
      },
      {
        "type": "case",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "The forms module was really practical. Spent time actually building forms in HubSpot and thinking about when to use them versus ungating content. Learned how to identify ideal moments for forms, create different form types based on your needs, and understand how form data flows into your contact database.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "265": {
    "skillId": "265",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "The campaigns module explained how campaigns are the fundamental building blocks of a marketing strategy in HubSpot. Learned how to create campaigns, attach assets to them, and then report on campaign performance to see what's delivering results. The dashboard view helps you stay focused on goals and measure what matters.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "342": {
    "skillId": "342",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "Practiced creating active lists (HubSpot calls them 'smart lists') that automatically update based on criteria you set. These are crucial for segmentation: you can build lists based on contact properties, page views, email engagement, form submissions, or any combination. Once set up, they maintain themselves as contacts meet or stop meeting your criteria.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "343": {
    "skillId": "343",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "The segmentation lessons went beyond basic list building into more complex logic: using AND/OR operators, multiple criteria, and behavioral data to create targeted segments. The course emphasized that good segmentation is the foundation for personalized marketing at scale, letting you deliver the right message to the right people.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "389": {
    "skillId": "389",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "Completed HubSpot's Marketing Hub certification over about 7 hours with hands-on practice in the platform. Learned how the CRM database works as the foundation for storing contact information and managing relationships. The course covered how Marketing Hub integrates with the CRM to create personalized experiences at scale.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "390": {
    "skillId": "390",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "The certification had a whole module on exploring the contacts database: how to manage contact records, track interactions, and use that foundational information to build relationships. Got practical experience navigating contact properties, updating records, and understanding how the database powers personalized marketing.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "394": {
    "skillId": "394",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "Spent 6-7 hours getting comfortable navigating Marketing Hub through hands-on exercises. Learned where all the key tools live: contacts, campaigns, emails, workflows, reporting—and how they work together as part of an inbound marketing strategy. The course gave me a solid mental map of where to find what I need.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "405": {
    "skillId": "405",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "Through the certification's practical exercises, learned how to work with contact properties to capture specific data about leads and customers. Understanding custom properties was key to segmentation and personalization. You need the right data fields to create meaningful segments and tailored experiences.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "411": {
    "skillId": "411",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "The segmentation module covered how to build both static and active lists in HubSpot. Practiced creating lists based on different criteria—contact properties, behaviors, and engagement. Active lists update automatically based on your criteria, while static lists capture a snapshot. Both are essential for organizing contacts and targeting campaigns.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "412": {
    "skillId": "412",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "One of the longest modules was on workflows and automation: how to set up automated sequences that engage contacts at the right time without manual effort. Built practice workflows with enrollment triggers, delays, branching logic, and actions. The course emphasized that marketing automation is vital for executing personalized engagement at scale.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "419": {
    "skillId": "419",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "The reporting module showed how to measure marketing performance and use data to optimize campaigns. Learned about the different report types available in Marketing Hub: traffic reports, campaign reports, contact attribution—and how to interpret the data to inform future marketing decisions.",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "421": {
    "skillId": "421",
    "evidenceCount": 1,
    "items": [
      {
        "type": "certification",
        "title": "HubSpot Marketing Hub Software Certification",
        "description": "Learned how to use HubSpot dashboards to visualize marketing performance in one place. The certification covered how to pull together different reports and metrics to create a view that helps you track progress toward goals and identify what's working (and what's not).",
        "url": "https://app-na2.hubspot.com/academy/achievements/rl63y16y/en/1/andrew-kelly/hubspot-marketing-hub-software",
        "date": "July 2025"
      }
    ]
  },
  "480": {
    "skillId": "480",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Made semantic HTML structure decisions throughout the Webflow build, even though I wasn't writing code directly. Set up proper heading hierarchy (H1 for page titles, H2 for major sections, H3 for FAQs), used semantic elements for navigation and footer sections, and ensured the underlying HTML made sense for basic SEO and accessibility. Webflow's visual interface made it easy to see the structure I was creating.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },   
  "482": {
    "skillId": "482",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Claude provided the initial visual system (colors, typography, spacing), but I tweaked and applied it throughout Webflow. Adjusted padding and margins to improve visual hierarchy, modified hover states for buttons and links, and fine-tuned responsive breakpoints when elements didn't look right on mobile. Understanding CSS concepts helped me know what to adjust in Webflow's visual editor to get the results I wanted.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },
  "487": {
    "skillId": "487",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Built the site to be responsive across desktop, tablet, and mobile breakpoints in Webflow. Made decisions about when to stack elements vertically on smaller screens, adjusted font sizes for readability across devices, and tested navigation patterns to ensure they worked everywhere. The three-column case study grid became two columns on tablet and single column on mobile, with different spacing at each breakpoint.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },
  "493": {
    "skillId": "493",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Worked with three interconnected JSON files:universe.json, skills.json, and portfolio.json, to manage all the app's data. Learned how nested objects and arrays structure the relationships between galaxies, constellations, and skills, and how to update values without breaking the connections. I didn't design the structure, but I understand how it works well enough to maintain it and troubleshoot when something's off.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      }
    ]
  }, 
  "497": {
    "skillId": "497",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Used Git to track changes throughout the project - made three commits to get it launched, and now I commit regularly whenever I update the app. It's basic version control (commits to main branch, no branching yet), but it keeps a record of what changed and when, so I'm not working off random file versions.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      }
    ]
  },
  "498": {
    "skillId": "498",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Set up a GitHub repo for this project and connected it to Vercel for automatic deployment. Every time I push changes to the main branch, GitHub triggers a rebuild and the site goes live in a few minutes. I'm not collaborating with anyone yet or using pull requests, but the repo stores all my code and gives me a deployment pipeline that actually works.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      }
    ]
  },
  "502": {
    "skillId": "502",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Set up custom domain configuration connecting andrewkelly.studio to Webflow's hosting through DNS records. Added A records and CNAME records to point the domain to Webflow's servers, understood propagation time, and verified SSL certificate generation. Had to troubleshoot when the DNS changes didn't propagate immediately and understood why it takes time for changes to take effect globally.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },
  "527": {
    "skillId": "527",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Created three main technical docs for this project: a content management guide that walks through adding galaxies, constellations, skills, and evidence (with troubleshooting), custom instructions for a Claude Project that maps skills to projects and writes evidence in my style, and a project summary that explains what was built. The goal was to document enough that I could hand this off or pick it back up months later without having to reverse-engineer how everything works.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      }
    ]
  }, 
  "530": {
    "skillId": "530",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "My Skill Universe - Interactive Portfolio Application",
        "description": "Created a complete guide for managing content: step-by-step instructions for adding galaxies, constellations, skills, and evidence, plus a troubleshooting section for common JSON errors. Included the full deployment workflow from local testing to pushing live. It captures the actual process I follow so I (or anyone else) can update the site without digging through code or trying to remember how everything connects.",
        "url": "https://andrewkelly.studio/case-studies/andrew-kellys-skill-universe",
        "date": "January 2026"
      }
    ]
  },
  "596": {
    "skillId": "596",
    "evidenceCount": 1,
    "items": [
      {
        "type": "blog",
        "title": "No Cookie Banners, No Tracking, No Shortcuts: My Privacy Policy Journey",
        "description": "Created a complete guide for managing content: step-by-step instructions for adding galaxies, constellations, skills, and evidence, plus a troubleshooting section for common JSON errors. Included the full deployment workflow from local testing to pushing live. It captures the actual process I follow so I (or anyone else) can update the site without digging through code or trying to remember how everything connects.",
        "url": "https://andrewkelly.studio/blog/no-cookie-banners-no-tracking-no-shortcuts-my-privacy-policy-journey",
        "date": "December 2025"
      }
    ]
  },
  "598": {
    "skillId": "598",
    "evidenceCount": 1,
    "items": [
      {
        "type": "blog",
        "title": "No Cookie Banners, No Tracking, No Shortcuts: My Privacy Policy Journey",
        "description": "Used Termly's questionnaire to generate a base privacy policy, which forced me to research exactly what data each third-party tool in my stack collected and why. After getting the template, I refined sections with Claude to make the language clearer and more aligned with my actual practices. Then I manually built the policy pages in Webflow instead of using Termly's embedded HTML, which would have added tracking to my privacy policy—kind of defeating the whole point.",
        "url": "https://andrewkelly.studio/blog/no-cookie-banners-no-tracking-no-shortcuts-my-privacy-policy-journey",
        "date": "December 2025"
      }
    ]
  },
  "599": {
    "skillId": "599",
    "evidenceCount": 1,
    "items": [
      {
        "type": "blog",
        "title": "No Cookie Banners, No Tracking, No Shortcuts: My Privacy Policy Journey",
        "description": "Researched CCPA requirements for California residents when building the privacy policy, including rights to know what data is collected, delete data, and opt-out of data sales (which I don't do). Added specific California privacy rights section explaining how residents can exercise their rights. The no-cookie approach made CCPA compliance easier since I'm not collecting or selling personal information through tracking.",
        "url": "https://andrewkelly.studio/blog/no-cookie-banners-no-tracking-no-shortcuts-my-privacy-policy-journey",
        "date": "December 2025"
      }
    ]
  },
  "603": {
    "skillId": "603",
    "evidenceCount": 1,
    "items": [
      {
        "type": "blog",
        "title": "No Cookie Banners, No Tracking, No Shortcuts: My Privacy Policy Journey",
        "description": "Implemented actual GDPR compliance by choosing privacy-respecting tools and documenting data processing in the privacy policy. Used Plausible Analytics (EU-hosted, GDPR-compliant), minimized form fields to only essential data, and provided clear contact methods for data requests. The implementation wasn't just writing a policy—it was making technical decisions that respect user privacy by default.",
        "url": "https://andrewkelly.studio/blog/no-cookie-banners-no-tracking-no-shortcuts-my-privacy-policy-journey",
        "date": "December 2025"
      }
    ]
  },
  "604": {
    "skillId": "604",
    "evidenceCount": 1,
    "items": [
      {
        "type": "blog",
        "title": "No Cookie Banners, No Tracking, No Shortcuts: My Privacy Policy Journey",
        "description": "Put CCPA compliance into practice by including required disclosures about data collection, user rights, and opt-out mechanisms in the privacy policy. Added specific sections for California residents explaining their rights and how to exercise them (contact form, email). Since I don't sell personal information or use invasive tracking, CCPA compliance was straightforward, but I still had to document it properly.",
        "url": "https://andrewkelly.studio/blog/no-cookie-banners-no-tracking-no-shortcuts-my-privacy-policy-journey",
        "date": "December 2025"
      }
    ]
  },
  "608": {
    "skillId": "608",
    "evidenceCount": 1,
    "items": [
      {
        "type": "blog",
        "title": "No Cookie Banners, No Tracking, No Shortcuts: My Privacy Policy Journey",
        "description": "Avoided cookie consent banners entirely by choosing Plausible Analytics, which doesn't use cookies or track personal data. This was a deliberate privacy-by-design decision—instead of asking permission to track users, I chose tools that don't require permission in the first place. Documented this approach in the blog post as an alternative to the typical 'accept cookies or leave' pattern most sites use.",
        "url": "https://andrewkelly.studio/blog/no-cookie-banners-no-tracking-no-shortcuts-my-privacy-policy-journey",
        "date": "December 2025"
      }
    ]
  },
  "614": {
    "skillId": "614",
    "evidenceCount": 1,
    "items": [
      {
        "type": "blog",
        "title": "No Cookie Banners, No Tracking, No Shortcuts: My Privacy Policy Journey",
        "description": "Applied privacy by design thinking from the start of the website build—choosing Plausible over Google Analytics, minimizing form fields, avoiding third-party tracking scripts. The principle was 'what's the least invasive way to get the data I need?' rather than 'what can I get away with?' Documented the entire decision making process in the blog post to show how privacy can be built into a site's architecture, not just its legal documents.",
        "url": "https://andrewkelly.studio/blog/no-cookie-banners-no-tracking-no-shortcuts-my-privacy-policy-journey",
        "date": "December 2025"
      }
    ]
  },
  "696": {
    "skillId": "696",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Managed all website assets through Webflow's asset manager, organizing files by use case (icons, Open Graph images, content images, custom fonts). Optimized file sizes both before uploading and using Webflow's built-in compression, and kept the environment clean by regularly removing unused assets. Made sure the custom Inter font files loaded correctly across the site without any tracking or external CDN dependencies.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },
  "700": {
    "skillId": "700",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Configured Webflow's CMS collections from scratch for case studies and blog posts, designing the field structure, content types, and relationships between different collection items. Set up automated publishing workflows so new case studies automatically appear in the portfolio grid with proper filtering, and blog posts flow to the resources page. The CMS handles all the templating and dynamic content generation once I publish a new piece.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  },
  "713": {
    "skillId": "713",
    "evidenceCount": 1,
    "items": [
      {
        "type": "case",
        "title": "Building andrewkelly.studio - AI-Powered Website Development",
        "description": "Implemented Plausible Analytics as a privacy-first alternative to Google Analytics for tracking site performance. Set up custom goals to track key conversions like contact form submissions without using cookies or collecting personal data beyond what users voluntarily provide in forms. The lightweight script tracks page views, traffic sources, and user behavior patterns while staying GDPR/CCPA compliant by default.",
        "url": "https://andrewkelly.studio/case-studies/building-my-digital-studio-a-platform-for-marketing-ops-experiments-ai-exploration-and-personal-interests",
        "date": "December 2025"
      }
    ]
  } 
}
